// ======= Задание 1:

// 1. Создайте массив с элементами 1, 2, 3.
// Выведите на экран каждый из этих элементов.
// const myArr = [1, 2, 3];
// console.log(myArr[0]);
// console.log(myArr[1]);
// console.log(myArr[2]);

// 2. Создайте массив с произвольными элементами.
// Выведите на экран количество элементов в этом массиве.
// console.log(myArr.length);

// 3. Создайте массив с элементами 'a', 'b', 'c'. Запишите вместо первого элемента
// число 1, вместо второго - 2, вместо третьего - 3.
// const letterArr = ['a', 'b', 'c'];
// console.log(letterArr);
// letterArr[0] = 1;
// letterArr[1] = 2;
// letterArr[2] = 3;
// console.log(letterArr);